Repository: revence27/rapidsms-nova
Catalog: rapidsmsrw1000/apps/ubuzima/locale/*/LC_MESSAGES/django.po
Languages: rw

source: %s Report:
rw: %s Raporo:

source: Patient=%s,
rw: Umubyeyi=%s,

source: Location=%s
rw: Aherereye=%s,

source: You need to be registered first, use the REG keyword
rw: Ugomba kubanza kwiyandikisha, koresha ijambo REG

source: The correct format message is: ANC MOTHER_ID VISIT_DATE ANC_ROUND ACTION_CODE LOCATION_CODE MOTHER_WEIGHT
rw: Wagombye kwandika: ANC INDANGAMUNTU_UMUBYEBYI ITALIKI_YO_KWIPIMISHA INCURO IBIMENYETSO AHO_YASUZUMIWE IBIRO_BY_UMUBYEYI

source: %(key)s:%(red)s is a red alert, please see how to report a red alert and try again.
rw: %(key)s:%(red)s Ubu turabona ari ubutumwa butabaza, reba uko bwoherezwa wongere ugerageze.

source: %(key)s:%(dth)s is a death, please see how to report a death and try again.
rw: %(key)s:%(dth)s Ubu turabona ari ubutumwa bw'ibyago by'urupfu, reba uko bwoherezwa wongere ugerageze.

source: This report has been recorded, and we cannot duplicate it again. Thank you!
rw: Iyi raporo warayiduhaye, twarayibonye. Murakoze!

source: Thank you! ANC report submitted. Please send also the pregnancy report of this patient %(nid)s.
rw: Murakoze! Ubutumwa bwo kwipimisha bw'uyu mubyeyi turabubonye. Mwibuke no kutwoherereza raporo yo gusama y'uyu mubyeyi %(nid)s.

source: The correct format message is: BIR MOTHER_ID CHILD_NUM DOB SEX ACTION_CODE LOCATION_CODE BREASTFEEDING CHILD_WEIGHT
rw: Andika: BIR INDANGAMUNTU NUMERO ITARIKI_AVUTSE IGITSINA IBIBAZO AHO_AVUKIYE IBIJYANYE_NO_KONKA IBIRO

source: Thank you! Birth report submitted successfully.
rw: MURAKOZE, ubutumwa bw'uwo mwana wavutse bwatugezeho, Ahiiiii!

source: The correct format message is: CBN MOTHER_ID CHILD_NUM DOB BREASTFEEDING CHILD_HEIGHT CHILD_WEIGHT MUAC
rw: Andika: CBN INDANGAMUNTU NUMERO_Y_UMWANA ITARIKI_YAVUTSE KONKA IBUBUREBURE UBUREMERE MUAC

source: Thank you! CBN report submitted successfully.
rw: Murakoze ubutumwa ku mirire y'umwana turabubonye!

source: The correct format message is: CCM MOTHER_ID CHILD_NUM DOB SYMPTOMS INTERVENTION MUAC
rw: Andika: CCM INDANGAMUNTU NUMERO_Y_UMWANA ITARIKI_YAVUTSE IBIBAZO UBUTABAZI MUAC

source: Thank you! CCM report submitted successfully.
rw: Murakoze ubutumwa ku butabazi bw ibanze uwo mubyeyi yari akeneye turabubonye.

source: The correct format message is: CHI MOTHER_ID CHILD_NUM DOB VACCINS VACCIN_SERIE ACTION_CODE LOCATION_CODE CHILD_WEIGHT MUAC
rw: Andika: CHI INDANGAMUNTU NUMERO_Y_UMWANA ITARIKI_YAVUTSE IBIJYANYE_N_IKINGIRA IBIBAZO_AFITE AHO_AHEREREYE IBIRO MUAC

source: Thank you! Child Health report submitted successfully.
rw: Murakoze ubutumwa ku buzima bw'umwana turabubonye.

source: The correct format message is: CMR MOTHER_ID CHILD_NUM DOB SYMPTOMS INTERVENTION MOTHER_STATUS CHILD_STATUS
rw: Andika: CMR INDANGAMUNTU NUMERO_Y_UMWANA ITARIKI_YAVUTSE IBIBAZO UBUTABAZI MUAC

source: Thank you! CMR report submitted successfully.
rw: Murakoze ubutumwa bw uko uwo mubyeyi amerewe turabubonye.

source: You never reported a departure. Departure are reported with the keyword DEP
rw: Ntabwo ari gutyo bohereza raporo y'abimutse, andika DEP usige akanya wandike kunko babibabwiye.

source: Thank you! Dep report submitted successfully.
rw: Murakoze, raporo ku mubyeyi wimutse turayibonye.

source: Invalid date format, must be in the form: DD.MM.YYYY
rw: Itariki ntabwo yanditswe neza, andika: Umunsi.Ukwezi.Umwaka

source: Invalid year, year must be between %(year_start)d and %(year_end)d, and date in the form: DD.MM.YYYY
rw: Umwaka ntiwanditse neza, ugomba kuba hagati ya %(year_start)d and %(year_end)d, ukandika UMUNSI.UKWEZI.UMWAKA

source: Invalid month, month must be between 1 and 12, and date in the form: DD.MM.YYYY
rw: Itariki ntabwo yanditswe neza, andika: Umunsi.Ukwezi.Umwaka

source: Invalid day, day must be between 1 and 31, and date in the form: DD.MM.YYYY
rw: Itariki ntabwo yanditswe neza, andika: Umunsi.Ukwezi.Umwaka

source: Patient ID is missing!
rw: Indangamuntu y'umubyeyi ntayo wanditse cyangwa yanditse ahatari mu mwanya wayo.

source: Child Number Is missing!
rw: Numero y'umwana ntayo wanditse cyangwa yanditse ahatari mu mwanya wayo.

source: Date of delivery Is missing!
rw: Itariki yabyariyeho cyangwa umwana yavukiye ntayo wanditse cyangwa yanditse ahatari mu mwanya wayo.

source: Location is missing!
rw: Aho byabereye ntaho wanditse cyangwa handitse ahatari mu mwanya waho.

source: Death Code Is missing!
rw: Codi y'urupfu ntayo wanditse cyangwa yanditse ahatari mu mwanya wayo.

source: Patient ID Is missing.
rw: Indangamuntu y'umurwayi ntiyashyizweho/ntiyatanzwe

source: Patient ID must be 16 digits of national ID Or 10 digits of CHW Phone Number + 6 digits of ddmmyy
rw: Umubare w'indangamuntu ugomba kuba imibare 16, cyangwa se imibare 10 ya telephone y'umujyanama wongeyeho imibare 6 igizwe n'imibare 2 y'uwo munsi, 2 y'uko kwezi n'imibare 2 ihera y'umwaka

source: Child Number Is missing.
rw: Numero y'umwana ntayo wanditse cg yanditse ahatari mu mwanya wayo

source: Please check you have the correct child number. This number should be a 2 digit number, the first digit is always 0 and second digit varies between 1-8
rw: Genzura niba numero iranga umwana ariyo. Iyo numero igomba kuba igizwe nimibare 2 ubanza ukaba ari 0 uwukurikiye ukaba hagati ya 1-8

source: Date of delivery should be equal to or less then current date
rw: Itariki yo kubyara igomba kuba ingana cyangwa se iri musi y'itariki yatangiweho ubutumwa

source: Location is missing! Please be sure that you have entered the appropriate Birth location. It should be HO, HP, OR or CL.
rw: Genzura niba wanditse neza aho umwana yavukiye. Ikimenyetso kigomba kuba HO, HP,OR cyangwa CL

source: Maternal Death Code Is missing! It should be MD because there is no child number and date of birth in this SMS.
rw: Codi y'urupfu ntabwo ariyo, yakabaye MD niba ari urupfu rw'umubyeyi kuko numero y'umwana n'itariki yavukiye ntabyo wohereje.

source: Death Code Is missing! Please be sure that you have entered the appropriate Death Code. It should be MD, CD, or ND.
rw: Codi y'urupfu ntayo. Rebako wakoresheje codi imwe nyayo muri izi : MD, CD, ND kandi mu mwanya wayo

source: You need to be registered first, Please contact your supervisor!
rw: Ugomba kubanza kwiyandikisha, saba ubufasha k'ushinzwe abajyanama kukigo nderabuzima

source: Thank you! Death report submitted successfully.
rw: Mukomeze kwihanga! ubutumwa ku byago by urupfu mwagize turabubonye!

source: The correct format message is: NBC MOTHER_ID CHILD_NUM NBC_ROUND DOB SYMPTOMS INTERVENTION CHILD_STATUS
rw: Andika: NBC INDANGAMUNTU NUMERO INSHURO ITARIKI_YAVUTSE IBIBAZO KONKA UBUTABAZI UKO_UMWANA_AMEZE

source: Thank you! NBC report submitted successfully.
rw: Murakoze! ubutumwa ku buzima bw uruhinje twabubonye.

source: The correct format message is: PNC MOTHER_ID PNC_ROUND DOB SYMPTOMS INTERVENTION CHILD_STATUS
rw: Andika: PNC INDANGAMUNTU INSHURO ITARIKI_YAVUTSE IBIBAZO UBUTABAZI UKO_UMWANA_AMEZE

source: Thank you! PNC report submitted successfully.
rw: Murakoze! ubutumwa ku buzima bw'umubyeyi twabubonye.

source: The correct format message is: PRE MOTHER_ID LAST_MENSES NEXT_VISIT PREVIOUS_RISK CURRENT_RISK LOCATION_CODE MOTHER_WEIGHT MOTHER_HEIGHT SANITATION TELEPHONE
rw: Andika: PRE INDANGAMUNTU ITARIKI_YIMIHANGO IYOGUSUBIRAYO INSHURO_YASAMYE IZAVUTSE IBIBAZO_KERA IBISHYA AHO_YAPIMIWE IBIRO UBUREBURE UMUSARANI KANDAGIRA TELEFONI

source: Parity cannot be greater or equal to Gravidity.
rw: Inshuro yabyaye ntizishobora kuruta izo yasamye.

source: Gravidity and Parity numbers are showing zero miscarriages.
rw: Inshuro yabyaye nizo yasamye byerekanako atikigeze akuramo inda.

source: Thank you! Pregnancy report submitted successfully.
rw: Murakoze, ubutumwa bw'uwo mubyeyi utwite bwatugezeho.

source: The correct format message is: RAR MOTHER_ID REPORTED_SYMPTOMS LOCATION_CODE INTERVENTION_CODE MOTHER_STATUS CHILD_STATUS
rw: Andika: RAR INDANGAMUNTU IBIBAZO_BYATANZWE AHO_AHEREREYE UBUTABAZI_BWAKOZWE UKO_UMUBYEYI AMEZE UKO_UMWANA_AMEZE

source: Invalid report syntax, please check to report this case.
rw: Raporo yanditse nabi. Reba uko ubwo butumwa bwandikwa wongere ugerageze.

source: Thank you! Red Alert Result report submitted successfully.
rw: Murakoze ubutumwa ku bisubizo by ibibazo uwo mubyeyi yari yagize turabubonye.

source: The correct format message is: RED MOTHER_ID ACTION_CODE LOCATION_CODE MOTHER_WEIGHT
rw: Andika: RED INDANGAMUNTU IBIMENYETSO_BY_IBIBAZO AHO_AHEREREYE

source: Thank you! RED Alert report submitted successfully.
rw: MURAKOZE, ubutumwa ku kibazo k'umubyeyi ukeneye ubutabazi bwihuse bwatugezeho!

source: You never reported a refusal. Refusals are reported with the keyword REF
rw: Ntabwo ari gutyo bohereza raporo y'abanze kwipimisha, andika REF usige akanya wandike ubusobanura kunko babibabwiye.

source: Thank you! REF report submitted successfully.
rw: Murakoze ubutumwa turabubonye!

source: The correct format message is: RES MOTHER_ID REPORTED_SYMPTOMS LOCATION_CODE INTERVENTION_CODE MOTHER_STATUS CHILD_STATUS
rw: Andika: RES INDANGAMUNTU IBIBAZO_BYATANZWE AHO_AHEREREYE UBUTABAZI_BWAKOZWE UKO_UMUBYEYI AMEZE UKO_UMWANA_AMEZE

source: Thank you! Risk Result report submitted successfully.
rw: Murakoze ubutumwa ku bisubizo by ibibazo uwo mubyeyi yari yagize turabubonye.

source: The correct format message is: RISK MOTHER_ID ACTION_CODE LOCATION_CODE MOTHER_WEIGHT
rw: Wagombye kwandika: RISK INDANGAMUNTU_UMUBYEBYI IBIMENYETSO AHO_AHEREREYE IBIRO

source: Thank you! Risk report submitted successfully.
rw: MURAKOZE, ubutumwa ku kibazo k'umubyeyi bwatugezeho!

source: Unknown action code: %(invalidcode)s.
rw: Ibyo kureba no kwitabwaho bikurikira ntibyanditswe neza: %(invalidcode)s.

source: You cannot give more than one location code
rw: Ntushobora gutanga ahantu habiri aho byabereye.

source: Error. %(error)s
rw: Ikosa! %(error)s

source: Invalid date, cannot be in the future.
rw: Andika neza itariki, iyo ntiragera.

source: Error. National ID must be exactly 16 digits, you sent the nid: %(nat_id)s with only %(uburefu)d digits
rw: Ikosa. Nomero y'irangamuntu igomba kugira imibare 16, wohereje %(nat_id)s n'imibare %(uburefu)d gusa

source: You need to be registered first
rw: Ugomba kubanza kwiyandikisha
